[
  {
    "title": "Test-driven Development",
    "authors": [
      "Kent Beck"
    ],
    "publisher": "Addison-Wesley Professional",
    "publishedDate": "2003",
    "description": "Write clean code that works with the help of this groundbreaking software method. Example-driven teaching is the basis of Beck's step-by-step instruction that will have readers using TDD to further their projects.",
    "image": "http://books.google.com/books/content?id=CUlsAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4,
    "ratingsCount": 3,
    "categories": [
      "Computers"
    ],
    "pageCount": 220,
    "isbn10": "0321146530",
    "isbn13": "9780321146533",
    "googleBooks": {
      "id": "CUlsAQAAQBAJ",
      "preview": "http://books.google.com/books?id=CUlsAQAAQBAJ&printsec=frontcover&dq=intitle:Test-Driven+Design+By+Example&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=CUlsAQAAQBAJ&dq=intitle:Test-Driven+Design+By+Example&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Test_driven_Development.html?hl=&id=CUlsAQAAQBAJ"
    },
    "issueNumber": 3,
    "progressPercent": 0,
    "state": "reading",
    "startedAt": "2022-07-01T16:57:42.000Z"
  },
  {
    "title": "Release It!",
    "authors": [
      "Michael T. Nygard"
    ],
    "publisher": "Pragmatic Bookshelf",
    "publishedDate": "2018-01-08",
    "description": "A single dramatic software failure can cost a company millions of dollars - but can be avoided with simple changes to design and architecture. This new edition of the best-selling industry standard shows you how to create systems that run longer, with fewer failures, and recover better when bad things happen. New coverage includes DevOps, microservices, and cloud-native architecture. Stability antipatterns have grown to include systemic problems in large-scale systems. This is a must-have pragmatic guide to engineering for production systems. If you're a software developer, and you don't want to get alerts every night for the rest of your life, help is here. With a combination of case studies about huge losses - lost revenue, lost reputation, lost time, lost opportunity - and practical, down-to-earth advice that was all gained through painful experience, this book helps you avoid the pitfalls that cost companies millions of dollars in downtime and reputation. Eighty percent of project life-cycle cost is in production, yet few books address this topic. This updated edition deals with the production of today's systems - larger, more complex, and heavily virtualized - and includes information on chaos engineering, the discipline of applying randomness and deliberate stress to reveal systematic problems. Build systems that survive the real world, avoid downtime, implement zero-downtime upgrades and continuous delivery, and make cloud-native applications resilient. Examine ways to architect, design, and build software - particularly distributed systems - that stands up to the typhoon winds of a flash mob, a Slashdotting, or a link on Reddit. Take a hard look at software that failed the test and find ways to make sure your software survives. To skip the pain and get the experience...get this book.",
    "image": "http://books.google.com/books/content?id=Ug9QDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 5,
    "ratingsCount": 2,
    "categories": [
      "Computers"
    ],
    "pageCount": 378,
    "isbn10": "1680504525",
    "isbn13": "9781680504521",
    "googleBooks": {
      "id": "Ug9QDwAAQBAJ",
      "preview": "http://books.google.com/books?id=Ug9QDwAAQBAJ&printsec=frontcover&dq=intitle:Release+It!&hl=&cd=1&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=Ug9QDwAAQBAJ&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=Ug9QDwAAQBAJ"
    },
    "issueNumber": 2,
    "progressPercent": 0,
    "state": "reading",
    "startedAt": "2022-05-21T23:39:45.000Z"
  },
  {
    "title": "Discovery",
    "authors": [
      "Gáspár Nagy"
    ],
    "publishedDate": "2018-02-07",
    "description": "Written by the creator of SpecFlow and the author of The Cucumber for Java Book, this book provides inside information on how to get the most out of the discovery phase of Behaviour Driven Development (BDD). This practical guide demonstrates good collaboration techniques, illustrated by concrete examples. This book is written for everyone involved in the specification and delivery of software (including product owners, business analysts, developers, and testers). The book starts by explaining the reasons BDD exists in the first place and describes techniques for getting the most out of collaboration between business and delivery team members. This is the first in the BDD Books series that will guide you through the entire development process, including specific technical practices needed to successfully drive development using collaboratively-authored specifications and living documentation.",
    "image": "http://books.google.com/books/content?id=FwLGswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "pageCount": 100,
    "isbn10": "1983591254",
    "isbn13": "9781983591259",
    "googleBooks": {
      "id": "FwLGswEACAAJ",
      "preview": "http://books.google.com/books?id=FwLGswEACAAJ&dq=intitle:Discovery:+Explore+behaviour+using+examples&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=FwLGswEACAAJ&dq=intitle:Discovery:+Explore+behaviour+using+examples&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Discovery.html?hl=&id=FwLGswEACAAJ"
    },
    "issueNumber": 1,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2022-05-21T23:38:18.000Z",
    "completedAt": "2022-05-22T13:46:44.000Z",
    "timeToComplete": 50906000,
    "timeToCompleteFormatted": "14 hours"
  }
]
